{"Coffee":{"title":"Coffee","links":["Thinking-About-Doomsday","todo/tea"],"tags":[],"content":"Coffee is interesting. I went from ‘ew’ to ‘hmm’ to ‘ew’ to ‘oh!’ to ‘good.‘\nBut now I like it and drink it sometimes.\nI try to not make myself dependent on it, like many of my friend are.\nI was reading this article by the Washington Post about coffee vs. tea, and it was interesting to me.\nSometimes, especially in the winter, coffee makes me think about doomsday more often. Tea doesn’t do this so much. And is more cozy. So I guess it wins."},"Sleep":{"title":"Sleep","links":[],"tags":[],"content":"Whenever I sleep in too much, I feel like I’ve wasted a lot of my day. And often I can’t sleep in much. The problem with this is that if I wake up earlier, I feel super tired and often feel like I can’t physically get out of bed. This makes it easy to rationalize that, y’know, maybe I should just sleep some more.\nThe things I’ve tried:\n\nWaking up even earlier (sleep cycles are weird okay)\n\nOften just feel more tired or exactly how I felt when waking up at a more normal time.\nThere was a series of about a week where I was able to wake up early frequently and feel great. I think this was just because I viewed it as a streak and was feeling too competitive.\n\n\nGoing to sleep earlier.\n\nThis one is hard because then I just lay there and don’t sleep. Unable to sleep for hours.\n\n\nWaking up and immediately (quickly) drinking coffee.\n\nI don’t like this way because it causes dependence on coffee, which I have done my best to avoid dependence on so far. Maybe I will try it with tea.\nIt was helpful just to drink something warm in the morning, and it motivated me to get up early because I needed to boil the water, which took time.\n\n\n\nHmm. There’s probably more that I’m just not remembering."},"Things-to-Write-About-(expanded)":{"title":"Things to Write About (expanded)","links":[],"tags":[],"content":"A list of the things I will someday write about. In no particular order. Also not using check boxes because those imply a necessity.\n\nBioethics\n”Never having time to do something” then wasting hours doing basically nothing.\nContext switching causing exhaustion.\nMath in origami.\nMultitasking.\nOrigami.\nNetworking (with computers)\nNetworking (with people)\nTaiko.\nWater.\nZettelkasten\nSpellcheck\n"},"Thinking-About-Doomsday":{"title":"Thinking About Doomsday","links":["Sleep"],"tags":[],"content":"I don’t actually think about my brain processes a lot of the time, they just sort of happen. Then, something will bring to my attention that I think about things in a way I don’t want to necessarily.\nA good example of this is what I call thinking about doomsday, better known to most people as catastrophic thinking. The American Medical Association defines this as “the endless fears, thinking of the worst-case scenario and that things won’t get better”1\nThis definitely happens more when I haven’t had enough Sleep, but it also sort of happens less. I become less able to think about other people’s perspectives and endless possibilities, that turn out to be completely unhelpful. More energy is spent on what is actually happening.\nI don’t think the solution is lifelong sleep deprivation, however.\nFootnotes\n\n\nwww.ama-assn.org/delivering-care/public-health/what-doctors-wish-patients-knew-about-stopping-catastrophic-thoughts ↩\n\n\n"},"Water":{"title":"Water","links":["Sleep","todo/english","todo/tea","Coffee","todo/math","todo/appreciation"],"tags":[],"content":"Along with some other “important” things, like Sleep, I have never really drank (drunk, drunken, dranken? ack English) enough water.\nI’ve always preferred it as tea, or Coffee, or something else, almost anything else.\nIt’s something that I’ve always know I should drink more but just never got around to it. Though recently I’ve been doing my best.\nI know that it is helpful. In fact, according to Harvard Medical School, “[w]ater makes up 60-75% of human body weight. A loss of just 4% of total body water leads to dehydration, and a loss of 15% can be fatal”1.\nGoing on the higher side of the estimate, does that mean water makes up ~37 kg of my total weight? In which case, I would need to lose 7.5 kg of water in order to have fatal loss of water? Hmm. That seems like a lot of water I would have to lose. It’s also very possible I’m doing the (basic) math wrong, or misunderstanding something, as I’m tired.\nAnyway, it was recently brought to my attention that water has a flavor. Some people might think “of course it does!” but like, the water you’ve grown up drinking, every day. You just start to ignore the flavor since it’s so mundane.\nTHEN I went to Houston, Texas, and wow. Their water has quite a different taste. It’s like salt water but you removed the physical salt, leaving just the essence. And also the property of never quite getting cold was added. Not a fan, sorry Texas.\nThe chemical properties of water, those I can understand the coolness of. The polarity, the cohesion and adhesion, the water potential (less of a fan of this one to be honest).\nWater is essential to life, so I guess I should be a little more appreciative.\nThanks water.\nFootnotes\n\n\nsitn.hms.harvard.edu/uncategorized/2019/biological-roles-of-water-why-is-water-necessary-for-life/ ↩\n\n\n"},"Why-Do-We-Exist":{"title":"Why Do We Exist?","links":[],"tags":[],"content":""},"index":{"title":"Index","links":[],"tags":["todo"],"content":"So I guess this is my main page. How I’m going to start is by writing about things I think are interesting, and then as I write, I might discover new things that I think would be fun to write about. then I’ll add those to my “todo” folder, and write about them later! I think it’ll be fun."},"todo/appreciation":{"title":"appreciation","links":[],"tags":[],"content":""},"todo/english":{"title":"english","links":[],"tags":[],"content":""},"todo/math":{"title":"math","links":[],"tags":[],"content":""},"todo/tea":{"title":"tea","links":[],"tags":[],"content":""}}